"""
    main.py -- wro mission entry point.
    main.py -- จุดเริ่มต้นสำหรับเขียนภารกิจ wro

    how to use:
    -----------
    1. write your mission logic in mission(odo, tm).
    2. use tm.start(coro) for non-blocking attachment movements.
    3. use kernel.run(mission) at the end of the file.
"""

import kernel
import pid_lib as P
import config  as C

# ███    ███ ██ ███████ ███████ ██  ██████  ███    ██ 
# ████  ████ ██ ██      ██      ██ ██    ██ ████   ██ 
# ██ ████ ██ ██ ███████ ███████ ██ ██    ██ ██ ██  ██ 
# ██  ██  ██ ██      ██      ██ ██ ██    ██ ██  ██ ██ 
# ██      ██ ██ ███████ ███████ ██  ██████  ██   ████ 
#
# >>mission logic
# >>ลำดับภารกิจ

async def mission(odo, tm):
    """
    write your mission here (เขียนภารกิจของคุณที่นี่)
    -------------------------------------------
    odo : odometry object (สำหรับคุมการเดิน)
    tm  : task manager (สำหรับคุมงานเบื้องหลัง เช่น แขนมอเตอร์)
    """
    
    # ⬐⬐ วางแผนเส้นทางการเดินที่นี่ ⬎⬎
    # ===============================================

    
    # ===============================================
    print("mission finished!")

#
# █████████████████████████████████████████████████████████████████████████████████████████████████████████████████████
# █████████████████████████████████████████████████████████████████████████████████████████████████████████████████████
#
#
# ███████ ██   ██ ███████  ██████ ██    ██ ████████ ██  ██████  ███    ██ 
# ██       ██ ██  ██      ██      ██    ██    ██    ██ ██    ██ ████   ██ 
# █████     ███   █████   ██      ██    ██    ██    ██ ██    ██ ██ ██  ██ 
# ██       ██ ██  ██      ██      ██    ██    ██    ██ ██    ██ ██  ██ ██ 
# ███████ ██   ██ ███████  ██████  ██████     ██    ██  ██████  ██   ████ 
#
# >>execution
# >>เริ่มการทำงาน

kernel.run(mission)
